{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa//home/wj/CarND-Term1-Project/Project_3/model.py\u00da\b<lambda>\u0014\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": [64, 64, 3], "function_type": "lambda", "output_shape_type": "raw", "input_dtype": "float32", "trainable": true, "batch_input_shape": [null, 64, 64, 3], "arguments": {}, "name": "lambda_1"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_regularizer": null, "nb_filter": 3, "init": "glorot_uniform", "bias": true, "trainable": true, "nb_col": 1, "subsample": [1, 1], "name": "color_conv", "border_mode": "same", "b_constraint": null, "W_regularizer": null, "nb_row": 1, "activation": "linear", "activity_regularizer": null, "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_regularizer": null, "nb_filter": 64, "init": "glorot_uniform", "bias": true, "trainable": true, "nb_col": 3, "subsample": [1, 1], "name": "block1_conv1", "border_mode": "same", "b_constraint": null, "W_regularizer": null, "nb_row": 3, "activation": "elu", "activity_regularizer": null, "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_regularizer": null, "nb_filter": 64, "init": "glorot_uniform", "bias": true, "trainable": true, "nb_col": 3, "subsample": [1, 1], "name": "block1_conv2", "border_mode": "same", "b_constraint": null, "W_regularizer": null, "nb_row": 3, "activation": "elu", "activity_regularizer": null, "dim_ordering": "tf"}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "pool_size": [2, 2], "trainable": true, "dim_ordering": "tf", "strides": [2, 2], "name": "block1_pool"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_regularizer": null, "nb_filter": 128, "init": "glorot_uniform", "bias": true, "trainable": true, "nb_col": 3, "subsample": [1, 1], "name": "block2_conv1", "border_mode": "same", "b_constraint": null, "W_regularizer": null, "nb_row": 3, "activation": "elu", "activity_regularizer": null, "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_regularizer": null, "nb_filter": 128, "init": "glorot_uniform", "bias": true, "trainable": true, "nb_col": 3, "subsample": [1, 1], "name": "block2_conv2", "border_mode": "same", "b_constraint": null, "W_regularizer": null, "nb_row": 3, "activation": "elu", "activity_regularizer": null, "dim_ordering": "tf"}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "pool_size": [2, 2], "trainable": true, "dim_ordering": "tf", "strides": [2, 2], "name": "block2_pool"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_regularizer": null, "nb_filter": 256, "init": "glorot_uniform", "bias": true, "trainable": true, "nb_col": 3, "subsample": [1, 1], "name": "block3_conv1", "border_mode": "same", "b_constraint": null, "W_regularizer": null, "nb_row": 3, "activation": "elu", "activity_regularizer": null, "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_regularizer": null, "nb_filter": 256, "init": "glorot_uniform", "bias": true, "trainable": true, "nb_col": 3, "subsample": [1, 1], "name": "block3_conv2", "border_mode": "same", "b_constraint": null, "W_regularizer": null, "nb_row": 3, "activation": "elu", "activity_regularizer": null, "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_regularizer": null, "nb_filter": 256, "init": "glorot_uniform", "bias": true, "trainable": true, "nb_col": 3, "subsample": [1, 1], "name": "block3_conv3", "border_mode": "same", "b_constraint": null, "W_regularizer": null, "nb_row": 3, "activation": "elu", "activity_regularizer": null, "dim_ordering": "tf"}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "pool_size": [2, 2], "trainable": true, "dim_ordering": "tf", "strides": [2, 2], "name": "block3_pool"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_regularizer": null, "nb_filter": 512, "init": "glorot_uniform", "bias": true, "trainable": true, "nb_col": 3, "subsample": [1, 1], "name": "block4_conv1", "border_mode": "same", "b_constraint": null, "W_regularizer": null, "nb_row": 3, "activation": "elu", "activity_regularizer": null, "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_regularizer": null, "nb_filter": 512, "init": "glorot_uniform", "bias": true, "trainable": true, "nb_col": 3, "subsample": [1, 1], "name": "block4_conv2", "border_mode": "same", "b_constraint": null, "W_regularizer": null, "nb_row": 3, "activation": "elu", "activity_regularizer": null, "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_regularizer": null, "nb_filter": 512, "init": "glorot_uniform", "bias": true, "trainable": true, "nb_col": 3, "subsample": [1, 1], "name": "block4_conv3", "border_mode": "same", "b_constraint": null, "W_regularizer": null, "nb_row": 3, "activation": "elu", "activity_regularizer": null, "dim_ordering": "tf"}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "pool_size": [2, 2], "trainable": true, "dim_ordering": "tf", "strides": [2, 2], "name": "block4_pool"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_regularizer": null, "nb_filter": 512, "init": "glorot_uniform", "bias": true, "trainable": true, "nb_col": 3, "subsample": [1, 1], "name": "block5_conv1", "border_mode": "same", "b_constraint": null, "W_regularizer": null, "nb_row": 3, "activation": "elu", "activity_regularizer": null, "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_regularizer": null, "nb_filter": 512, "init": "glorot_uniform", "bias": true, "trainable": true, "nb_col": 3, "subsample": [1, 1], "name": "block5_conv2", "border_mode": "same", "b_constraint": null, "W_regularizer": null, "nb_row": 3, "activation": "elu", "activity_regularizer": null, "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_regularizer": null, "nb_filter": 512, "init": "glorot_uniform", "bias": true, "trainable": true, "nb_col": 3, "subsample": [1, 1], "name": "block5_conv3", "border_mode": "same", "b_constraint": null, "W_regularizer": null, "nb_row": 3, "activation": "elu", "activity_regularizer": null, "dim_ordering": "tf"}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "pool_size": [2, 2], "trainable": true, "dim_ordering": "tf", "strides": [2, 2], "name": "block5_pool"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "Flatten"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_regularizer": null, "input_dim": 2048, "init": "glorot_uniform", "bias": true, "trainable": true, "name": "fc1", "b_constraint": null, "W_regularizer": null, "activation": "elu", "activity_regularizer": null, "output_dim": 1024}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "fc1_dropout", "p": 0.5}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_regularizer": null, "input_dim": 1024, "init": "glorot_uniform", "bias": true, "trainable": true, "name": "fc2", "b_constraint": null, "W_regularizer": null, "activation": "elu", "activity_regularizer": null, "output_dim": 256}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "fc2_dropout", "p": 0.5}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_regularizer": null, "input_dim": 256, "init": "glorot_uniform", "bias": true, "trainable": true, "name": "fc3", "b_constraint": null, "W_regularizer": null, "activation": "elu", "activity_regularizer": null, "output_dim": 128}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "fc3_dropout", "p": 0.5}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_regularizer": null, "input_dim": 128, "init": "glorot_uniform", "bias": true, "trainable": true, "name": "fc4", "b_constraint": null, "W_regularizer": null, "activation": "elu", "activity_regularizer": null, "output_dim": 64}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "fc4_dropout", "p": 0.5}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_regularizer": null, "input_dim": 64, "init": "glorot_uniform", "bias": true, "trainable": true, "name": "fc5", "b_constraint": null, "W_regularizer": null, "activation": "elu", "activity_regularizer": null, "output_dim": 32}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "fc5_dropout", "p": 0.5}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_regularizer": null, "input_dim": 32, "init": "zero", "bias": true, "trainable": true, "name": "output", "b_constraint": null, "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "output_dim": 1}}], "keras_version": "1.2.1"}